Tekla Open API Reference for Tekla Structures 2025
MaterialItemEnumerator.Current Property
 Returns a material item instance of the current element.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MaterialItem Current { get; }
Public ReadOnly Property Current As MaterialItem
	Get
Property Value
Type: MaterialItem
See Also
Reference
MaterialItemEnumerator Class
Tekla.Structures.Catalogs Namespace